Show / Hide Table of Contents
Enum ConcreteMemberType
Member type
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum ConcreteMemberType
Fields
 Name |  Description
 Beam
Beam
 BeamSlab
Beam slab
 Column
Column
 HollowCoreSlab
Hollw core slab
 NoDefined
Not defined
 Plate
Plate
 TwoWaySlab
2-way slab
 Wall
Wall
 Improve this Doc
 View Source